def counter(start: int, step: int = 1):
    while True:
        yield start
        start += step


# for n in counter(-1000):
#     print(n, end=' ')


collections = [
    (10, -10, 20, -20, 30, -30, 40, -40),
    'очень длинная строка',
    [.99, .91, 1.01, .96]
]
for iterable in collections:
    for item in zip(counter(0), iterable):
        print(item)
    print()

# (0, 10)
# (1, -10)
# (2, 20)
# (3, -20)
# (4, 30)
# (5, -30)
# (6, 40)
# (7, -40)

# (0, 'о')
# (1, 'ч')
# (2, 'е')
# (3, 'н')
# (4, 'ь')
# (5, ' ')
# (6, 'д')
# (7, 'л')
# (8, 'и')
# (9, 'н')
# (10, 'н')
# (11, 'а')
# (12, 'я')
# (13, ' ')
# (14, 'с')
# (15, 'т')
# (16, 'р')
# (17, 'о')
# (18, 'к')
# (19, 'а')

# (0, 0.99)
# (1, 0.91)
# (2, 1.01)
# (3, 0.96)

