insert authors values (1, 'Толстой', 'Лев');

insert authors
  (last_name, first_name)
values
  ('Достоевский', 'Фёдор'),
  ('Булгаков', 'Михаил');

insert authors
  (first_name, last_name)
values
  ('Сергей', 'Лукьяненко'),
  ('Лоис', 'Буджолд'),
  ('Дэвид', 'Вебер');


insert into books
  (author_id, title)
values
  (2, 'Преступление и наказание'),
  (2, 'Бесы'),
  (1, 'Война и мир'),
  (2, 'Братья Карамазовы'),
  (3, 'Мастер и Маргарита'),
  (5, 'Барраяр'),
  (5, 'Игры форов'),
  (4, 'Спектр'),
  (4, 'Осенние визиты'),
  (6, 'Космическая станция \"Василиск\"'),
  (6, 'Честь королевы'),
  (5, 'Цетаганда'),
  (4, 'Звёздная тень');


-- insert publishers
insert ignore publishers
  (name)
values
  ('АСТ'),
  ('Эксмо'),
  ('Вече'),
  (' ========== издательство-с-длинным-названием ========== '),
  (null);


insert books_publishers
values
  ('0-7137-9256-6', 1, 3),
  ('0-4549-3435-1', 2, 3),
  ('0-2111-7463-7', 4, 3),
  ('0-7359-8665-7', 3, 3),
  ('0-6212-0401-3', 1, 2),
  ('0-4834-1224-4', 5, 2),
  ('0-1835-0534-4', 10, 2),
  ('0-9102-3888-X', 11, 2),
  ('0-5756-2463-9', 6, 1),
  ('0-7908-5083-4', 7, 1),
  ('0-5696-8260-6', 12, 1),
  ('0-8062-8838-8', 8, 1),
  ('0-9398-6607-2', 9, 1),
  ('0-1659-7621-7', 13, 1),
  ('0-2663-7917-6', 9, 2),
  ('0-3263-6403-X', 7, 1),
  ('0-7212-9549-5', 5, 3),
  ('0-8350-7665-2', 10, 1);

