from numpy import array, dot


x = array([1, 5, 6, 9, 12, 14, 20])

p1 = array([1/7]*7)
p2 = array([0.9, 0.02, 0.01, 0.01, 0.02, 0.01, 0.03])
p3 = array([0.05, 0.01, 0.01, 0.03, 0.02, 0.01, 0.87])
p4 = array([0.01, 0.01, 0.01, 0.01, 0.01, 0.94, 0.01])

# среднее арифметическое значений случайной велчины
# >>> sum(x) / len(x)
# np.float64(9.571428571428571)

# математическое ожидание равновероятного распределения случайной величины
# >>> dot(x, p1)
# np.float64(9.57142857142857)

# >>> dot(x, p2)
# np.float64(2.1300000000000003)

# >>> dot(x, p3)
# np.float64(18.209999999999997)

# >>> dot(x, p4)
# np.float64(13.69)

const = 10

# >>> const * x
# array([ 10,  50,  60,  90, 120, 140, 200])

# >>> dot(const*x, p1)
# np.float64(95.71428571428571)
# >>>
# >>> const * dot(x, p1)
# np.float64(95.7142857142857)
# >>>
# >>> dot(const*x, p2)
# np.float64(21.3)
# >>>
# >>> const * dot(x, p2)
# np.float64(21.300000000000004)

