select 32;

-- +----+
-- | 32 |
-- +----+
-- | 32 |
-- +----+
-- 1 row in set (0.0004 sec)


select 32 as col1;

-- +------+
-- | col1 |
-- +------+
-- |   32 |
-- +------+
-- 1 row in set (0.0003 sec)


select 14 + 23;

-- +---------+
-- | 14 + 23 |
-- +---------+
-- |      37 |
-- +---------+
-- 1 row in set (0.0004 sec)


select 14 + 23 as col1;

-- +------+
-- | col1 |
-- +------+
-- |   37 |
-- +------+
-- 1 row in set (0.0003 sec)


select curdate();

-- +------------+
-- | curdate()  |
-- +------------+
-- | 2024-06-08 |
-- +------------+
-- 1 row in set (0.0004 sec)


select curdate() as today;

-- +------------+
-- | today      |
-- +------------+
-- | 2024-06-08 |
-- +------------+
-- 1 row in set (0.0003 sec)


select 29 as col1, 11 as col2, 40 as col3;

-- +------+------+------+
-- | col1 | col2 | col3 |
-- +------+------+------+
-- |   29 |   11 |   40 |
-- +------+------+------+
-- 1 row in set (0.0004 sec)


select
  29 as col1,
  11 as col2,
  40 as col3;

-- +------+------+------+
-- | col1 | col2 | col3 |
-- +------+------+------+
-- |   29 |   11 |   40 |
-- +------+------+------+
-- 1 row in set (0.0004 sec)


select 10 from library.authors;

-- +----+
-- | 10 |
-- +----+
-- | 10 |
-- | 10 |
-- | 10 |
-- | 10 |
-- | 10 |
-- | 10 |
-- +----+
-- 6 rows in set (0.0008 sec)


select id, first_name, last_name from library.authors;

-- +----+------------+-------------+
-- | id | first_name | last_name   |
-- +----+------------+-------------+
-- |  1 | Лев        | Толстой     |
-- |  2 | Фёдор      | Достоевский |
-- |  3 | Михаил     | Булгаков    |
-- |  4 | Сергей     | Лукьяненко  |
-- |  5 | Лоис       | Буджолд     |
-- |  6 | Дэвид      | Вебер       |
-- +----+------------+-------------+
-- 6 rows in set (0.0007 sec)


select concat(first_name, ' ', last_name) from library.authors;

-- +------------------------------------+
-- | concat(first_name, ' ', last_name) |
-- +------------------------------------+
-- | Лев Толстой                        |
-- | Фёдор Достоевский                  |
-- | Михаил Булгаков                    |
-- | Сергей Лукьяненко                  |
-- | Лоис Буджолд                       |
-- | Дэвид Вебер                        |
-- +------------------------------------+
-- 6 rows in set (0.0007 sec)


select 
  concat(first_name, ' ', last_name) as full_name 
from 
  library.authors;

-- +-------------------+
-- | full_name         |
-- +-------------------+
-- | Лев Толстой       |
-- | Фёдор Достоевский |
-- | Михаил Булгаков   |
-- | Сергей Лукьяненко |
-- | Лоис Буджолд      |
-- | Дэвид Вебер       |
-- +-------------------+
-- 6 rows in set (0.0005 sec)

