# арифметические операторы

# >>> 1 + 2
# 3
# >>> 2 - 6
# -4
# >>> 6 * 8
# 48
# >>> 2 / 5
# 0.4
# >>> 18 / 3
# 6.0
# >>> 10 / 4
# 2.5
# >>> 10 // 4
# 2
# >>> 10 % 4
# 2
# >>> 18 % 3
# 0
# >>> 2 ** 8
# 256
# >>> 2 ** 0.5
# 1.4142135623730951
# >>> 16 ** 0.25
# 2.0


# перегрузка арифметических операторов для вещественных (float) чисел

# >>> 1.0 + 2
# 3.0
# >>> 10.0 // 4
# 2.0
# >>> 7 % 2
# 1
# >>> 7 % 2.0
# 1.0


# перегрузка операторов сложения и умножения для последовательностей

# >>> 'abc' + 'def'
# 'abcdef'
# >>>
# >>> 'abc' + 7
# Traceback (most recent call last):
  # File "<stdin>", line 1, in <module>
# TypeError: can only concatenate str (not "int") to str
# >>>
# >>> 'abc' * 3
# 'abcabcabc'
# >>>
# >>> [1, 2] * 3
# [1, 2, 1, 2, 1, 2]
# >>>
# >>> (3, 4) * 3
# (3, 4, 3, 4, 3, 4)
# >>>
# >>> [0.1, 0.2] + [11, 22]
# [0.1, 0.2, 11, 22]


# операторы сравнения

# >>> 1 == 1
# True
# >>> 1 == 2
# False
# >>>
# >>> 'abc' == 'ABC'
# False
# >>>
# >>> [1, 2] == [1, 2]
# True
# >>> [1, 2] == [1, 2, 3]
# False
# >>>
# >>> [1, 2] == [1, '2']
# False
# >>>
# >>> 1 != 2
# True
# >>> 1 != 1
# False
# >>> 
# >>> 6 > 3
# True
# >>> 6 > 6
# False
# >>> 6 >= 6
# True
# >>>
# >>> 9 < 12
# True
# >>> 9 < 9
# False
# >>> 9 <= 9
# True


# перегрузка операторов сравнения для последовательностей

# >>> 'abc' > 'xyz'
# False
# >>> 'abc' < 'xyz'
# True
# >>> 'aa' < 'ab'
# True
# >>> 'azz' < 'xaa'
# True
# >>> 'z' > 'aaa'
# True
# >>> '9' < '12'
# False


# условный оператор

# >>> 10 if True else -10
# 10
# >>> 10 if False else -10
# -10
# >>> 10 if 'abc' < 'xyz' else -10
# 10
# >>> 10 if 5 % 2 == 1 else -10
# 10
# >>> 10 if 6 % 2 == 1 else -10
# -10

