items1 = ['яблоко', 'карандаш', 'телефон']
items2 = ('кабель', 'чашка', 'ножницы')


# >>> items1
# ['яблоко', 'карандаш', 'телефон']
# >>>
# >>> type(items1)
# <class 'list'>
# >>>
# >>> items1[0]
# 'яблоко'
# >>> items1[1]
# 'карандаш'
# >>> items1[2]
# 'телефон'
# >>>
# >>> items1[0] = 'бумага'
# >>>
# >>> items1
# ['бумага', 'карандаш', 'телефон']


# >>> items2
# ('кабель', 'чашка', 'ножницы')
# >>>
# >>> type(items2)
# <class 'tuple'>
# >>>
# >>> items2[0]
# 'кабель'
# >>> items2[1]
# 'чашка'
# >>> items2[2]
# 'ножницы'
# >>>
# >>> items2[0] = 'подставка'
# TypeError: 'tuple' object does not support item assignment

