mammals = {'тигр', 'верблюд', 'баран', 'кит', 'морж'}
aquatic = {'осьминог', 'кальмар', 'краб', 'кит', 'морж'}
aquatic_mammals = {'кит', 'морж'}
reptiles = {'черепаха', 'змея', 'ящерица', 'крокодил'}


# >>> mammals | aquatic
# {'краб', 'баран', 'верблюд', 'осьминог', 'морж', 'тигр', 'кальмар', 'кит'}
# >>>
# >>> mammals & aquatic
# {'кит', 'морж'}
# >>>
# >>> mammals - aquatic
# {'баран', 'тигр', 'верблюд'}
# >>>
# >>> aquatic - mammals
# {'краб', 'кальмар', 'осьминог'}
# >>>
# >>> mammals ^ aquatic
# {'краб', 'баран', 'тигр', 'осьминог', 'кальмар', 'верблюд'}
# >>>
# >>> (mammals | aquatic) - (mammals & aquatic)
# {'краб', 'баран', 'осьминог', 'верблюд', 'тигр', 'кальмар'}


# >>> aquatic_mammals < mammals
# True
# >>>
# >>> mammals > aquatic_mammals
# True
# >>>
# >>> {1, 2, 3} < {1, 2, 3}
# False
# >>> {1, 2, 3} <= {1, 2, 3}
# True


